app/models/staff.rb

SELECT "staffs".* FROM "staffs"
---
  def self.alphabetically_sorted
    return self.all.sort_by{|s| s[:name].downcase}